DataProcessors/ОбработкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаДанных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НейронныеСети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НейронныеСети</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесаВходовНейрона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НейроннаяСеть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛинейныеНейронныеСети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Нейрон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нейроны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВходыНейрона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВходовНейрона</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОбработкаДанных/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроверитьЧек(Команда)
	
	Сообщить(ПроверкаЧеков.ПроверитьЧек(ДанныеШтрихкода, ТекПользователь()));
	
КонецПроцедуры

&НаСервере
Функция ТекПользователь()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьСообщенияНаСервере()
	
	ОбменТелеграм.ОбработатьКоманды();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщения(Команда)
	
	ОбработатьСообщенияНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьIAMЯндексНаСервере()
	
	ОбменЯндекс.ОбновитьIAMТокен();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьIAMЯндекс(Команда)
	
	ОбновитьIAMЯндексНаСервере();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбновитьПроксиAPIНаСервере()
	
	СлужебныеПроцедуры.ОбновитьПрокси();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПроксиAPI(Команда)
	
	ОбновитьПроксиAPIНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Строка = "Добавить в кошелёк 50 рублей и принисите мне чёрный кофе с двумя ложками сахара и молоком!";
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого ВыбранныйФайл Из ВыбранныеФайлы Цикл
		ДобавитьВСловарьИзФайлаНаСервере(ВыбранныйФайл);
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура ДобавитьВСловарьИзФайлаНаСервере(ИмяФайла)
	
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.Прочитать(ИмяФайла, КодировкаТекста.UTF8);
	
	КоличествоСтрок = ТекДок.КоличествоСтрок();
	
	Для Индекс = 3 По КоличествоСтрок Цикл
		
		ТекСтрока = ТекДок.ПолучитьСтроку(Индекс);
		Если СтрНайти(ТекСтрока, "--------") <> 0 Или СтрНайти(ТекСтрока, "++++++++") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока) Тогда
			Справочники.Униграммы.ДобавитьУниграммыВСловарь(ТекСтрока);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНейроныНаСервере(НейроннаяСеть)
	
	НаборЗаписей = РегистрыСведений.НейронныеСети.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НейроннаяСеть.Установить(НейроннаяСеть);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	// Входы нейрона
	ИмяМетаданных = Метаданные.НайтиПоТипу(НейроннаяСеть.ВидВходаНейрона.ТипЗначения.Типы()[0]).ПолноеИмя();
	Выборка = СлужебныеПроцедуры.МенеджерОбъектаПоПолномуИмени(ИмяМетаданных).Выбрать();
	
	// нейроны
	ИмяМетаданных = Метаданные.НайтиПоТипу(НейроннаяСеть.ВидНейронов.ТипЗначения.Типы()[0]).ПолноеИмя();
	Менеджер = СлужебныеПроцедуры.МенеджерОбъектаПоПолномуИмени(ИмяМетаданных);
	
	// рандом пока что
	Вес = 0.01;
	
	Пока Выборка.Следующий() Цикл
		
		Для каждого Значение Из Менеджер Цикл
			
			Запись = НаборЗаписей.Добавить();
			Запись.НейроннаяСеть = НейроннаяСеть;
			Запись.ВходНейрона = Выборка.Ссылка;
			Запись.Нейрон = Значение;
			Запись.Вес = Вес;
			
			Вес = Вес + 0.01;
						
		КонецЦикла; 
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНейроны(Команда)
	
	ЗаполнитьНейроныНаСервере(НейроннаяСеть);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НейроннаяСеть = Справочники.ЛинейныеНейронныеСети.АнализТекстаСообщения;
	ТекстСообщенияАнализа = "Поступление 10 рублей.";
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьВероятности(Команда)
	
	ОчиститьСообщения();
	
	ВычислитьВероятностиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьВероятностиНаСервере()
	
	Вероятности = НейронныеСети.ПолучитьВероятности(НейроннаяСеть, ТекстСообщенияАнализа);
	
	Если Вероятности = Неопределено Тогда
		Сообщить("Ошибка: нейросеть не обучена полностью");
	КонецЕсли;
	
	Для каждого СтрокаВероятность Из Вероятности Цикл
		
		Сообщить("" + СтрокаВероятность.Нейрон + " -- " + СтрокаВероятность.Вероятность);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбучитьНейроннуюСеть(Команда)
	
	НейронныеСетиВызовСервера.ОбучитьНейроннуюСеть(НейроннаяСеть);
	
КонецПроцедуры
